<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Comment</key>
	<string>Created with Recipe Robot v1.0.1 (https://github.com/homebysix/recipe-robot)</string>
	<key>Description</key>
	<string>Downloads the latest version of Password Monitor.</string>
	<key>Identifier</key>
	<string>com.github.chalcahuite.download.PasswordMonitor</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>Password Monitor</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.5.0</string>
	<key>Process</key>
	<array>
        <dict>
            <key>Processor</key>
            <string>DeprecationWarning</string>
            <key>Arguments</key>
            <dict>
                <key>warning_message</key>
                <string>Google Password Monitor is no longer being developed. This recipe is deprecated and will be removed in the future.</string>
            </dict>
        </dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>appcast_url</key>
				<string>https://storage.googleapis.com/google-code-archive-downloads/v2/code.google.com/password-expiration-monitor/pwdmon.xml</string>
			</dict>
			<key>Processor</key>
			<string>SparkleUpdateInfoProvider</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>com.github.homebysix.FindAndReplace/FindAndReplace</string>
			<key>Arguments</key>
			<dict>
				<key>input_string</key>
				<string>%url%</string>
				<key>find</key>
				<string>://password-expiration-monitor.googlecode.com/files/</string>
				<key>replace</key>
				<string>://storage.googleapis.com/google-code-archive-downloads/v2/code.google.com/password-expiration-monitor/</string>
			</dict>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>url</key>
				<string>%output_string%</string>
				<key>filename</key>
				<string>%NAME%-%version%.zip</string>
			</dict>
			<key>Processor</key>
			<string>URLDownloader</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
	</array>
</dict>
</plist>
