<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
    <dict>
        <key>Description</key>
        <string>Download recipe for Enterprise Connect. Since EC is provided through Apple Professional Services via a cloud download, not sure if any of the current AutoPkg URL processors will actually works with the link APS provides. But this file is here for future use/completion's sake. URL below is a stub.</string>
        <key>Identifier</key>
        <string>om.github.chalcahuite.download.enterprise-connect</string>
        <key>Input</key>
        <dict>
            <key>NAME</key>
            <string>EnterpriseConnect</string>
            <key>DOWNLOAD_URL</key>
            <string>https://attache.apple.com/AttacheWeb/dl?id=ATCa0e53f6055aa4964bbd0cea0bddff5d1&amp;ek=ATCHQDLgv0rGFnCu7njGGDJng%3D%3D</string>
        </dict>
        <key>MinimumVersion</key>
        <string>0.5.0</string>
        <key>Process</key>
        <array>
            <dict>
                <key>Processor</key>
                <string>URLDownloader</string>
                <key>Arguments</key>
                <dict>
                    <key>url</key>
                    <string>%DOWNLOAD_URL%</string>
                    <key>filename</key>
                    <string>%NAME%.zip</string>
                </dict>
            </dict>
            <dict>
                <key>Processor</key>
                <string>EndOfCheckPhase</string>
            </dict>
        </array>
    </dict>
</plist>