<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Comment</key>
    <string>
This AutoPkg recipe was created using JSSRecipeCreator:
https://github.com/sheagcraig/JSSRecipeCreator

It is meant to be used with JSSImporter:
https://github.com/sheagcraig/JSSImporter

For tips on integrating JSSImporter into your Casper environment, check out Auto Update Magic:
https://github.com/homebysix/auto-update-magic</string>
    <key>Description</key>
    <string>Packages the dockutil download.  Install directory /usr/local/bin Then, uploads to the JSS.</string>
    <key>Identifier</key>
    <string>com.github.autopkg.chalcahuite.jss.dockutil</string>
    <key>Input</key>
    <dict>
        <key>CATEGORY</key>
        <string>Utilities</string>
        <key>DESCRIPTION</key>
        <string></string>
        <key>EXTENSION_ATTRIBUTE_TEMPLATE</key>
        <string>%RECIPE_DIR%/dockutilExtensionAttribute.xml</string>
        <key>GROUP_NAME</key>
        <string>%NAME%-update-smart</string>
        <key>GROUP_TEMPLATE</key>
        <string>%RECIPE_DIR%/dockutilSmartGroupTemplate.xml</string>
        <key>ICON</key>
        <string></string>
        <key>NAME</key>
        <string>dockutil</string>
        <key>POLICY_CATEGORY</key>
        <string>Testing</string>
        <key>POLICY_TEMPLATE</key>
        <string>%RECIPE_DIR%/dockutilPolicyTemplate.xml</string>
    </dict>
    <key>MinimumVersion</key>
    <string>1.0.0</string>
    <key>ParentRecipe</key>
    <string>com.github.autopkg.jessepeterson.pkg.dockutil</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>version</key>
                <string>%version%</string>
                <key>category</key>
                <string>%CATEGORY%</string>
                    <key>extension_attributes</key>
                    <array>
                        <dict>
                            <key>ext_attribute_path</key>
                            <string>%EXTENSION_ATTRIBUTE_TEMPLATE%</string>
                        </dict>
                    </array>
                <key>groups</key>
                <array>
                    <dict>
                        <key>name</key>
                        <string>%GROUP_NAME%</string>
                        <key>smart</key>
                        <true/>
                        <key>template_path</key>
                        <string>%GROUP_TEMPLATE%</string>
                    </dict>
                </array>
                <key>policy_category</key>
                <string>%POLICY_CATEGORY%</string>
                <key>policy_template</key>
                <string>%POLICY_TEMPLATE%</string>
                <key>prod_name</key>
                <string>%NAME%</string>
                <key>self_service_description</key>
                <string>%DESCRIPTION%</string>
                <key>self_service_icon</key>
                <string>%ICON%</string>
            </dict>
            <key>Processor</key>
            <string>JSSImporter</string>
        </dict>
    </array>
</dict>
</plist>
